In [1]:
myfood = ['banana', 'apple', 'candy']
print(myfood[0])
print(myfood[1])
print(myfood[2])

banana
apple
candy

In [2]:
for item in myfood:
    print(item)

banana
apple
candy

In [3]:
dict1 = {'one':'하나', 'two':'둘', 'three':'셋'}
dict2 = { 1:'하나', 2:'둘', 3:'셋' }
dict3 = { 'col1':[1,2,3], 'col2':['a', 'b', 'c']  }

In [4]:
print(dict1)
print(dict2)
print(dict3)

{'one': '하나', 'two': '둘', 'three': '셋'}
{1: '하나', 2: '둘', 3: '셋'}
{'col1': [1, 2, 3], 'col2': ['a', 'b', 'c']}

In [13]:
import pandas as pd
# from matplotlib.pyplot import plt
import matplotlib as mpl

In [17]:
print("pandas : ", pd.__version__)
print("matplotlib :", mpl.__version__)

pandas :  1.2.4
matplotlib : 3.3.4

In [22]:
from pandas import Series, DataFrame

In [23]:
## ___ = Series([1000,14000,3000,30000,10000])
score = pd.Series([1000,14000,3000,30000,10000])
print(score)

0     1000
1    14000
2     3000
3    30000
4    10000
dtype: int64

In [24]:
type(score)

pandas.core.series.Series

In [25]:
print(score.index)
print(score.values)

print(type(score.index))
print(type(score.values))

RangeIndex(start=0, stop=5, step=1)
[ 1000 14000  3000 30000 10000]
<class 'pandas.core.indexes.range.RangeIndex'>
<class 'numpy.ndarray'>

In [26]:
score = Series([1000,14000,3000], index=['2019-05-01', '2019-05-02', '2019-05-03'])
print(score)

2019-05-01     1000
2019-05-02    14000
2019-05-03     3000
dtype: int64

In [27]:
### 실습 1-1 series를 만들기(자료형)
### 실습 1-2 index 넣어보기

In [28]:
score = Series(['a', 'b', 'c'])
score

0    a
1    b
2    c
dtype: object

In [32]:
idx = pd.date_range(start="2020-01-01",end="2020-01-03").tolist()

score_idx = Series( ['a', 'b', 'c'], 
                   index=idx )
score_idx

2020-01-01    a
2020-01-02    b
2020-01-03    c
dtype: object

In [29]:
score_idx = Series(['a', 'b', 'c'], index=['2021-09-16', '2021-09-17', '2021-09-18'])
score_idx

2021-09-16    a
2021-09-17    b
2021-09-18    c
dtype: object

In [30]:
for idx in score.index:
    print(idx)

0
1
2

In [31]:
for value in score.values:
    print(value)

a
b
c

In [33]:
gildong = Series([1500,3000,2500], index=['2019-05-01', '2019-05-02', '2019-05-03'])

toto = Series([3000,3000,2000], index =['2019-05-01', '2019-05-02', '2019-05-03'] )

In [34]:
gildong+toto

2019-05-01    4500
2019-05-02    6000
2019-05-03    4500
dtype: int64

In [ ]:
idx1 = pd.date_range(start="2020-01-01",end="2020-01-03").tolist()
idx2 = pd.date_range(start="2020-02-01",end="2020-02-03").tolist()

gildong = Series( [1500,3000,2500],
              index = idx1)

toto = Series( [3000,3000,2000],
              index = idx2)

In [35]:
gildong

2019-05-01    1500
2019-05-02    3000
2019-05-03    2500
dtype: int64

In [36]:
toto

2019-05-01    3000
2019-05-02    3000
2019-05-03    2000
dtype: int64

In [37]:
## 데이터 프레임의 이해
* Pandas(판다스)의 대표적인 기본 자료형
* Seaborn 데이터 (load_dataset()-판다스)
 * seaborn에 들어가는 기본적인 데이터 자료형 pandas
* plotly에서도 pandas 호환

SyntaxError: invalid syntax (<ipython-input-37-03fafed38d41>, line 2)

In [38]:
from pandas import DataFrame

In [43]:
# ValueError : Shape of passed values is (4,3), indices imply (3,3)
idx_date = pd.date_range(start="2020-01-01", end="2020-01-03").tolist()

In [42]:
dat = {'col1':[1,2,3,4],
       'col2':[10,20,30,40],
       'col3':['A','B','C','D']}
df = DataFrame(dat)
df

   col1  col2 col3
0     1    10    A
1     2    20    B
2     3    30    C
3     4    40    D

In [44]:
from pandas import DataFrame

team_score = { "toto":[1500,3000,5000,7000,5500],
               "apple":[4000,5000,6000,5500,4500],
               "gildong":[2000,2500,3000,4000,3000],
               "catanddog":[7000,5000,3000,5000,4000]}

team_df = DataFrame(team_score)
team_df

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000
1  3000   5000     2500       5000
2  5000   6000     3000       3000
3  7000   5500     4000       5000
4  5500   4500     3000       4000

In [46]:
team_df['catanddog']

0    7000
1    5000
2    3000
3    5000
4    4000
Name: catanddog, dtype: int64

In [50]:
# 두 개의 열 선택
sel = ['catanddog', 'toto']
team_df[sel]

   catanddog  toto
0       7000  1500
1       5000  3000
2       3000  5000
3       5000  7000
4       4000  5500

In [51]:
# 두 개의 열 선택 - 잘못된 선택
# team_df.loc[]
# team_df.iloc[]

SyntaxError: invalid syntax (<ipython-input-51-f91edb707eb4>, line 2)

In [52]:
team_df

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000
1  3000   5000     2500       5000
2  5000   6000     3000       3000
3  7000   5500     4000       5000
4  5500   4500     3000       4000

In [53]:
# team_df.loc [행선택, 열선택]
team_df.loc [ : , 'apple':'gildong']

   apple  gildong
0   4000     2000
1   5000     2500
2   6000     3000
3   5500     4000
4   4500     3000

In [60]:
# team_df.loc [행선택, 열선택]
team_df.loc [ 0:2 , 'toto':'gildong']

   toto  apple  gildong
0  1500   4000     2000
1  3000   5000     2500
2  5000   6000     3000

In [61]:
team_df.loc [ 0:4 , ['apple', 'catanddog']]

   apple  catanddog
0   4000       7000
1   5000       5000
2   6000       3000
3   5500       5000
4   4500       4000

In [63]:
team_df  [['apple', 'catanddog']]  ## loc없으면 열선택만

   apple  catanddog
0   4000       7000
1   5000       5000
2   6000       3000
3   5500       5000
4   4500       4000

In [64]:
team_df.loc [ 2:3 , ['apple', 'gildong','catanddog']]

   apple  gildong  catanddog
2   6000     3000       3000
3   5500     4000       5000

In [65]:
team_df.iloc[:,:]

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000
1  3000   5000     2500       5000
2  5000   6000     3000       3000
3  7000   5500     4000       5000
4  5500   4500     3000       4000

In [66]:
team_df.iloc[[0],:]

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000

In [67]:
team_df.iloc[[2,3,4],:]

   toto  apple  gildong  catanddog
2  5000   6000     3000       3000
3  7000   5500     4000       5000
4  5500   4500     3000       4000

In [68]:
team_df.iloc [ 1:5, 1:3 ]

   apple  gildong
1   5000     2500
2   6000     3000
3   5500     4000
4   4500     3000

In [69]:
team_df.iloc[0:3, 1:3]

   apple  gildong
0   4000     2000
1   5000     2500
2   6000     3000

In [75]:
team_df.iloc  [[0,2,4], [1,3]]

   apple  catanddog
0   4000       7000
2   6000       3000
4   4500       4000

In [76]:
idx_date = pd.date_range(start="2020-01-01",end="2020-01-05").tolist()
team_df.index = idx_date
team_df

            toto  apple  gildong  catanddog
2020-01-01  1500   4000     2000       7000
2020-01-02  3000   5000     2500       5000
2020-01-03  5000   6000     3000       3000
2020-01-04  7000   5500     4000       5000
2020-01-05  5500   4500     3000       4000

In [77]:
idx_date = pd.date_range(start="2019-05-01",end="2019-05-05").tolist()
team_df.index = idx_date
team_df

            toto  apple  gildong  catanddog
2019-05-01  1500   4000     2000       7000
2019-05-02  3000   5000     2500       5000
2019-05-03  5000   6000     3000       3000
2019-05-04  7000   5500     4000       5000
2019-05-05  5500   4500     3000       4000

In [78]:
print(team_df.loc[ '2019-05-02' ] ) # 19-05-02 일
print("-----------")
print(team_df.loc[ ['2019-05-02', '2019-05-03'] ]) # 5월 2일, 3일 
print("-----------")
print(team_df.loc[ '2019-05-02': ])  # 5월 2일 이후 전체 데이터 가져오기

toto         3000
apple        5000
gildong      2500
catanddog    5000
Name: 2019-05-02 00:00:00, dtype: int64
-----------
            toto  apple  gildong  catanddog
2019-05-02  3000   5000     2500       5000
2019-05-03  5000   6000     3000       3000
-----------
            toto  apple  gildong  catanddog
2019-05-02  3000   5000     2500       5000
2019-05-03  5000   6000     3000       3000
2019-05-04  7000   5500     4000       5000
2019-05-05  5500   4500     3000       4000

In [80]:
print(team_df.iloc[0])
print(type(team_df.iloc[0]))

toto         1500
apple        4000
gildong      2000
catanddog    7000
Name: 2019-05-01 00:00:00, dtype: int64
<class 'pandas.core.series.Series'>

In [81]:
print(team_df.iloc[1:2, :])  # 첫번째 두번째 행 접근

            toto  apple  gildong  catanddog
2019-05-02  3000   5000     2500       5000

In [82]:
team_df.sum()

toto         22000
apple        25000
gildong      14500
catanddog    24000
dtype: int64

In [83]:
## 일반 통계 - 합, 평균, 표준편차,,,

In [84]:
team_df

            toto  apple  gildong  catanddog
2019-05-01  1500   4000     2000       7000
2019-05-02  3000   5000     2500       5000
2019-05-03  5000   6000     3000       3000
2019-05-04  7000   5500     4000       5000
2019-05-05  5500   4500     3000       4000

In [85]:
team_df.sum(axis=0)  # index별 합 : (0), column 별 합 : (1)

toto         22000
apple        25000
gildong      14500
catanddog    24000
dtype: int64

In [86]:
## 실습 4-2 통계량 구하기
team_df.

SyntaxError: invalid syntax (<ipython-input-86-b06a86af46b7>, line 2)

In [87]:
print(team_df.max())
print(team_df.min())

toto         7000
apple        6000
gildong      4000
catanddog    7000
dtype: int64
toto         1500
apple        4000
gildong      2000
catanddog    3000
dtype: int64

In [88]:
team_df['toto'].sum()

22000

In [89]:
team_df [['toto', 'gildong']].sum()

toto       22000
gildong    14500
dtype: int64

In [90]:
team_df.count()

toto         5
apple        5
gildong      5
catanddog    5
dtype: int64

In [95]:
### 실습
#apple과 catanddog의 sum(), mean(), std()

team_df [['apple', 'catanddog']].mean()

apple        5000.0
catanddog    4800.0
dtype: float64

In [94]:
team_df [['apple', 'catanddog']].std()

apple         790.569415
catanddog    1483.239697
dtype: float64

In [98]:
team_df

            toto  apple  gildong  catanddog  row_sum
2019-05-01  1500   4000     2000       7000    29000
2019-05-02  3000   5000     2500       5000    31000
2019-05-03  5000   6000     3000       3000    34000
2019-05-04  7000   5500     4000       5000    43000
2019-05-05  5500   4500     3000       4000    34000

In [97]:
team_df['row_sum']=team_df.sum(axis=1)
team_df

            toto  apple  gildong  catanddog  row_sum
2019-05-01  1500   4000     2000       7000    29000
2019-05-02  3000   5000     2500       5000    31000
2019-05-03  5000   6000     3000       3000    34000
2019-05-04  7000   5500     4000       5000    43000
2019-05-05  5500   4500     3000       4000    34000

In [99]:
team_df.cumsum()

             toto  apple  gildong  catanddog  row_sum
2019-05-01   1500   4000     2000       7000    29000
2019-05-02   4500   9000     4500      12000    60000
2019-05-03   9500  15000     7500      15000    94000
2019-05-04  16500  20500    11500      20000   137000
2019-05-05  22000  25000    14500      24000   171000

In [100]:
### titanic 데이터셋으로 요약 보고서 작성
import seaborn as sns

t = sns.load_dataset("titanic")
t

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [101]:
t.shape

(891, 15)

In [107]:
t[['age', 'fare'] ].mean()

age     29.699118
fare    32.204208
dtype: float64

In [113]:
t[['age','fare']].median()

age     28.0000
fare    14.4542
dtype: float64

In [108]:
t.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [109]:
t.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [110]:
t.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [111]:
t.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [112]:
t.cumsum()

TypeError: can only concatenate str (not "float") to str

In [114]:
t.loc[0:]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [116]:
t.iloc[:500, :10]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who
0,0,3,male,22.0,1,0,7.2500,S,Third,man
1,1,1,female,38.0,1,0,71.2833,C,First,woman
2,1,3,female,26.0,0,0,7.9250,S,Third,woman
3,1,1,female,35.0,1,0,53.1000,S,First,woman
4,0,3,male,35.0,0,0,8.0500,S,Third,man
...,...,...,...,...,...,...,...,...,...,...
495,0,3,male,NaN,0,0,14.4583,C,Third,man
496,1,1,female,54.0,1,0,78.2667,C,First,woman
497,0,3,male,NaN,0,0,15.1000,S,Third,man
498,0,1,female,25.0,1,2,151.5500,S,First,woman
499,0,3,male,24.0,0,0,7.7958,S,Third,man

In [117]:
## t.columns : 컬럼명 확인
## t.shape : 행과 열 확인
## t.describe() : 통계량 확인
## t. head() : 앞의 5행 확인
## t. tail() : 뒤의 5행 확인

In [118]:
team_df

            toto  apple  gildong  catanddog  row_sum
2019-05-01  1500   4000     2000       7000    29000
2019-05-02  3000   5000     2500       5000    31000
2019-05-03  5000   6000     3000       3000    34000
2019-05-04  7000   5500     4000       5000    43000
2019-05-05  5500   4500     3000       4000    34000

In [119]:
team_df['row_sum']

2019-05-01    29000
2019-05-02    31000
2019-05-03    34000
2019-05-04    43000
2019-05-05    34000
Name: row_sum, dtype: int64

In [120]:
team_df.shape

(5, 5)

In [122]:
team_df['row_sum'].sort_values(ascending=False)

2019-05-04    43000
2019-05-03    34000
2019-05-05    34000
2019-05-02    31000
2019-05-01    29000
Name: row_sum, dtype: int64

In [123]:
team_df

            toto  apple  gildong  catanddog  row_sum
2019-05-01  1500   4000     2000       7000    29000
2019-05-02  3000   5000     2500       5000    31000
2019-05-03  5000   6000     3000       3000    34000
2019-05-04  7000   5500     4000       5000    43000
2019-05-05  5500   4500     3000       4000    34000

In [125]:
team_df.sort_values('row_sum', ascending=False)

            toto  apple  gildong  catanddog  row_sum
2019-05-04  7000   5500     4000       5000    43000
2019-05-03  5000   6000     3000       3000    34000
2019-05-05  5500   4500     3000       4000    34000
2019-05-02  3000   5000     2500       5000    31000
2019-05-01  1500   4000     2000       7000    29000

In [128]:
team_df['row_mean']=team_df.mean(axis=1)
team_df

            toto  apple  gildong  catanddog  row_sum  row_mean
2019-05-01  1500   4000     2000       7000    29000    8700.0
2019-05-02  3000   5000     2500       5000    31000    9300.0
2019-05-03  5000   6000     3000       3000    34000   10200.0
2019-05-04  7000   5500     4000       5000    43000   12900.0
2019-05-05  5500   4500     3000       4000    34000   10200.0

In [129]:
team_df['row_mean']=team_df.iloc[:, 0:4].mean(axis=1)
team_df.sort_values('row_mean', ascending=False)

            toto  apple  gildong  catanddog  row_sum  row_mean
2019-05-04  7000   5500     4000       5000    43000    5375.0
2019-05-03  5000   6000     3000       3000    34000    4250.0
2019-05-05  5500   4500     3000       4000    34000    4250.0
2019-05-02  3000   5000     2500       5000    31000    3875.0
2019-05-01  1500   4000     2000       7000    29000    3625.0

In [130]:
## 자료형 - 시리즈, 데이터프레임
## 
## 행과 열 선택 : loc, iloc
## date_range()
## 새로운 열 추가하는 것에 대해 배운다. __['새로운 컬럼명']=___
## 통계량 구하기 [].sum(), mean(), std(), axis = 0 (각 열의 최종합, 행들의 합)
## axis = 1 (행의 합, column들의 합)
## 값을 정렬 sort_values()

In [133]:
### 행의 합이 15000 이상인 값을 뽑는다
## 01 조건을 걸어 데이터를 뽑기 - 행의 합이 15000 이상인 값을 뽑는다

In [135]:
team_df

            toto  apple  gildong  catanddog  row_sum  row_mean
2019-05-01  1500   4000     2000       7000    29000    3625.0
2019-05-02  3000   5000     2500       5000    31000    3875.0
2019-05-03  5000   6000     3000       3000    34000    4250.0
2019-05-04  7000   5500     4000       5000    43000    5375.0
2019-05-05  5500   4500     3000       4000    34000    4250.0

In [137]:
team_df.loc[team_df.row_sum >= 15000 , : ]

            toto  apple  gildong  catanddog  row_sum  row_mean
2019-05-01  1500   4000     2000       7000    29000    3625.0
2019-05-02  3000   5000     2500       5000    31000    3875.0
2019-05-03  5000   6000     3000       3000    34000    4250.0
2019-05-04  7000   5500     4000       5000    43000    5375.0
2019-05-05  5500   4500     3000       4000    34000    4250.0

In [143]:
## 02 조건을 2개 걸어 데이터 뽑기 - 행의 합이 15000 이상, 행의 평균이 4000 이상인 값 뽑기
team_df

            toto  apple  gildong  catanddog  row_sum  row_mean
2019-05-01  1500   4000     2000       7000    29000    3625.0
2019-05-02  3000   5000     2500       5000    31000    3875.0
2019-05-03  5000   6000     3000       3000    34000    4250.0
2019-05-04  7000   5500     4000       5000    43000    5375.0
2019-05-05  5500   4500     3000       4000    34000    4250.0

In [148]:
team_df.loc [ (team_df['row_sum'] >= 15000) & (team_df.['row_mean'] >=4000)  , : ]

SyntaxError: invalid syntax (<ipython-input-148-c20e3ab6f53d>, line 1)

In [ ]:
### titanic 데이터셋으로 요약 보고서 작성
import seaborn as sns

t = sns.load_dataset("titanic")
t

In [ ]:
t.shape

In [ ]:
t[['age', 'fare'] ].mean()

In [ ]:
t[['age','fare']].median()

In [ ]:
t.columns

In [ ]:
t.head()

In [ ]:
t.tail()

In [ ]:
t.info()